package com.biz.hello;

public class varstring_01 {
	//시작점, 진입점
	//run(^f11)을 실행
	//제일먼저 작동하는 코드
	public static void main(String[] args) {
		
		//정수형 변수선언
		//정수값 저장 위한 공간 선언
		//정수값:정수리터럴
		int num=10;
		
		//문자형, character형 변수 선언
		//문자 : ''마크로 묶여있는 문자리터럴 저장 위한 공간선언
				
	    char char1='a';
		char char2='가';	
		
		//문자열형:문자들이 나열된 형태
		//문자열형, String형 변수선언
	    //문자열:""로 묶여 있는 문자열 리터럴 저장공간 선언
		String str1="대한민국";				
		/*
		 * 일반적인 프로그램언어에서는
		 * 문자를 저장하는 방식은 모두 가능
		 * 
		 * 하지만 문자열은
		 * 프로그램언어 마다 다소 다른 방식으로 취급
		 * 
		 * 전통적인 c 언어 환경에서는 문자열을 취급하는데
		 * 상당히 어려운 방법 사용
		 * 
		 * 자바는 설계당시에 문자열을 취급하는 방법이 없었음
		 * string이라는 클래스형 키워드로
		 * 매우 쉽게 문자열 취급
		 * 
		 * 자바는 생산성에 중심을 둔 언어 원래 설계당시에 없었던
		 * 
		 */
		
		
	}

}