package com.biz.addr.exec;

/*
 * 아무런 코드도 없는 클래스를 하나 생성하면
 * 클래스 내부에는 기본 생성자 라고하는 특별한 method가 자동으로 선언이 된다.
 */
public class NewClass_01 {
	
	// 기본생성
	/*
	 *  클래스를 사용하여 객체를 선언하고
	 * 초기화를 할때 생성자(new NewClass_01() )라는 method를 호출하게 되는데
	 * 자바에서 클래스를 만들게 되면 모든 클래스에느
	 * 		자신의 이름과 같은 method가 자동으로 생성된다. 
	 * 객체를 초기화할때 이 생성자를 호출하여 초기화를 수행하는 것이다.
	 * 
	 * 생성자를 임의로 작성하고자 할때는 
	 * 	접근제한자를 public
	 * 
	 * 생성자를 임의로 작송하는 이유
	 * 1.클래스에 선ㅇ언된 필드변수들을 초기화 하기 위하여
	 * 2.클래스를 객체로
	 * 
	 * 클래스를 선언만 하고
	 * 임의의 메서드를 선언하여 사용하면
	 * 당연히 기본생성자가 자동으로 생성된다
	 * 
	 * 
	 */
	// public NewClass_01() {
	//	
	//}
	
	// 임의로 생성한 method 
	public void test() {
		
	}

}
